
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>底层编程 · Go语言圣经</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">


    
    <link rel="next" href="ch13-01.html" />
    
    
    <link rel="prev" href="../ch12/ch12-09.html" />
    

    </head>
    <body>
        
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            <a href=".." class="logo">
                <img src="../gitbook/images/logo/64.png">
                <h1>Go语言圣经</h1>
            </a>

            

            <div class="page_search_block">
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                
                <a href="ch13-01.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-right"></i>
                </a>
                
                
                <a href="../ch12/ch12-09.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-left"></i>
                </a>
                
            
            </div>
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default ">
        

        <div class="list-group">
            
    
        
        <a href="../" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            前言

        
        </a>
        

        
    
        
        <a href="../ch1/ch1.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            入门

        
        </a>
        

        
    
        
        <a href="../ch2/ch2.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            程序结构

        
        </a>
        

        
    
        
        <a href="../ch3/ch3.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            基础数据类型

        
        </a>
        

        
    
        
        <a href="../ch4/ch4.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            复合数据类型

        
        </a>
        

        
    
        
        <a href="../ch5/ch5.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            函数

        
        </a>
        

        
    
        
        <a href="../ch6/ch6.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            方法

        
        </a>
        

        
    
        
        <a href="../ch7/ch7.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            接口

        
        </a>
        

        
    
        
        <a href="../ch8/ch8.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            Goroutines和Channels

        
        </a>
        

        
    
        
        <a href="../ch9/ch9.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            基于共享变量的并发

        
        </a>
        

        
    
        
        <a href="../ch10/ch10.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            包和工具

        
        </a>
        

        
    
        
        <a href="../ch11/ch11.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            测试

        
        </a>
        

        
    
        
        <a href="../ch12/ch12.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            反射

        
        </a>
        

        
    
        
        <a href="ch13.html" class="list-group-item active">
        

            

            
            <i class="octicon octicon-chevron-down"></i>
            

            底层编程

        
        </a>
        

        
        
    
        
        <a href="ch13-01.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            unsafe.Sizeof, Alignof 和 Offsetof

        
        </a>
        

        
    
        
        <a href="ch13-02.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            unsafe.Pointer

        
        </a>
        

        
    
        
        <a href="ch13-03.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            示例: 深度相等判断

        
        </a>
        

        
    
        
        <a href="ch13-04.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            通过cgo调用C代码

        
        </a>
        

        
    
        
        <a href="ch13-05.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            几点忠告

        
        </a>
        

        
    

        
    
        
        <a href="../appendix/appendix.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            附录

        
        </a>
        

        
    

        </div>
    </div>
    



                    </div>
                    <div class="col-md-9">
                        
<div id="book-search-results">
    <div class="search-noresults">
    
                            
                            <div class="gb-markdown book-page-inner">
                                <h1 id="&#x7B2C;&#x5341;&#x4E09;&#x7AE0;&#x3000;&#x5E95;&#x5C42;&#x7F16;&#x7A0B;">&#x7B2C;&#x5341;&#x4E09;&#x7AE0;&#x3000;&#x5E95;&#x5C42;&#x7F16;&#x7A0B;</h1>
<p>Go&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x5305;&#x542B;&#x4E86;&#x8BF8;&#x591A;&#x5B89;&#x5168;&#x7B56;&#x7565;&#xFF0C;&#x9650;&#x5236;&#x4E86;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x51FA;&#x9519;&#x7684;&#x7528;&#x6CD5;&#x3002;&#x7F16;&#x8BD1;&#x65F6;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x5927;&#x591A;&#x6570;&#x7C7B;&#x578B;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x505A;&#x51CF;&#x6CD5;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x5B57;&#x7B26;&#x4E32;&#x3001;map&#x3001;slice&#x548C;chan&#x7B49;&#x6240;&#x6709;&#x7684;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#xFF0C;&#x90FD;&#x6709;&#x4E25;&#x683C;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x89C4;&#x5219;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x65E0;&#x6CD5;&#x9759;&#x6001;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F8B;&#x5982;&#x6570;&#x7EC4;&#x8BBF;&#x95EE;&#x8D8A;&#x754C;&#x6216;&#x4F7F;&#x7528;&#x7A7A;&#x6307;&#x9488;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x52A8;&#x6001;&#x68C0;&#x6D4B;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x5728;&#x9047;&#x5230;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x7ACB;&#x5373;&#x7EC8;&#x6B62;&#x5E76;&#x6253;&#x5370;&#x76F8;&#x5173;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF08;&#x5783;&#x573E;&#x5185;&#x5B58;&#x81EA;&#x52A8;&#x56DE;&#x6536;&#xFF09;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x5927;&#x90E8;&#x5206;&#x91CE;&#x6307;&#x9488;&#x548C;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x76F8;&#x5173;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>Go&#x8BED;&#x8A00;&#x7684;&#x5B9E;&#x73B0;&#x523B;&#x610F;&#x9690;&#x85CF;&#x4E86;&#x5F88;&#x591A;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#x3002;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x771F;&#x5B9E;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x65F6;&#x51FD;&#x6570;&#x5BF9;&#x5E94;&#x7684;&#x673A;&#x5668;&#x7801;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x5F53;&#x524D;&#x7684;goroutine&#x662F;&#x8FD0;&#x884C;&#x5728;&#x54EA;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x4E4B;&#x4E0A;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;Go&#x8BED;&#x8A00;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x4F1A;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x9700;&#x8981;&#x5C06;&#x67D0;&#x4E2A;goroutine&#x4ECE;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x8F6C;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x3002;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x53D8;&#x91CF;&#x7684;&#x6307;&#x9488;&#x4E5F;&#x5E76;&#x6CA1;&#x6709;&#x5C55;&#x793A;&#x53D8;&#x91CF;&#x771F;&#x5B9E;&#x7684;&#x5730;&#x5740;&#x3002;&#x56E0;&#x4E3A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x6839;&#x636E;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x53D8;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#xFF0C;&#x5F53;&#x7136;&#x53D8;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x5730;&#x5740;&#x4E5F;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;Go&#x8BED;&#x8A00;&#x7684;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4F7F;&#x5F97;Go&#x7A0B;&#x5E8F;&#x76F8;&#x6BD4;&#x8F83;&#x4F4E;&#x7EA7;&#x7684;C&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#x66F4;&#x5BB9;&#x6613;&#x9884;&#x6D4B;&#x548C;&#x7406;&#x89E3;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E5F;&#x4E0D;&#x5BB9;&#x6613;&#x5D29;&#x6E83;&#x3002;&#x901A;&#x8FC7;&#x9690;&#x85CF;&#x5E95;&#x5C42;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4E5F;&#x4F7F;&#x5F97;Go&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x5177;&#x6709;&#x9AD8;&#x5EA6;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x4E49;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x72EC;&#x7ACB;&#x4E8E;&#x4EFB;&#x4F55;&#x7F16;&#x8BD1;&#x5668;&#x5B9E;&#x73B0;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;CPU&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x7684;&#xFF08;&#x5F53;&#x7136;&#x4E5F;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x7EDD;&#x5BF9;&#x72EC;&#x7ACB;&#xFF1A;&#x4F8B;&#x5982;int&#x7B49;&#x7C7B;&#x578B;&#x5C31;&#x4F9D;&#x8D56;&#x4E8E;CPU&#x673A;&#x5668;&#x5B57;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x67D0;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x6C42;&#x503C;&#x7684;&#x5177;&#x4F53;&#x987A;&#x5E8F;&#xFF0C;&#x8FD8;&#x6709;&#x7F16;&#x8BD1;&#x5668;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x9650;&#x5236;&#x7B49;&#xFF09;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x90E8;&#x5206;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x800C;&#x4F18;&#x5148;&#x9009;&#x62E9;&#x5177;&#x6709;&#x66F4;&#x597D;&#x6027;&#x80FD;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x9700;&#x8981;&#x4E0E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x5E93;&#x8FDB;&#x884C;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x7EAF;Go&#x8BED;&#x8A00;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x67D0;&#x4E9B;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x4F7F;&#x7528;unsafe&#x5305;&#x6765;&#x6446;&#x8131;Go&#x8BED;&#x8A00;&#x89C4;&#x5219;&#x5E26;&#x6765;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x8BB2;&#x8FF0;&#x5982;&#x4F55;&#x521B;&#x5EFA;C&#x8BED;&#x8A00;&#x51FD;&#x6570;&#x5E93;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x5E94;&#x8BE5;&#x8F7B;&#x6613;&#x4F7F;&#x7528;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x5C5E;&#x4E8E;&#x9ED1;&#x9B54;&#x6CD5;&#xFF0C;&#x867D;&#x7136;&#x529F;&#x80FD;&#x5F88;&#x5F3A;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5BB9;&#x6613;&#x8BEF;&#x4F24;&#x5230;&#x81EA;&#x5DF1;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5904;&#x7406;&#x597D;&#x7EC6;&#x8282;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5404;&#x79CD;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x5E76;&#x4E14;&#x9690;&#x6666;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x6709;&#x7ECF;&#x9A8C;&#x7684;C&#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x3002;&#x4F7F;&#x7528;unsafe&#x5305;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x653E;&#x5F03;&#x4E86;Go&#x8BED;&#x8A00;&#x4FDD;&#x8BC1;&#x4E0E;&#x672A;&#x6765;&#x7248;&#x672C;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x7684;&#x627F;&#x8BFA;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5FC5;&#x7136;&#x4F1A;&#x6709;&#x610F;&#x65E0;&#x610F;&#x4E2D;&#x4F7F;&#x7528;&#x5F88;&#x591A;&#x975E;&#x516C;&#x5F00;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x5B9E;&#x73B0;&#x7684;&#x7EC6;&#x8282;&#x5728;&#x672A;&#x6765;&#x7684;Go&#x8BED;&#x8A00;&#x4E2D;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;unsafe&#x5305;&#x662F;&#x4E00;&#x4E2A;&#x91C7;&#x7528;&#x7279;&#x6B8A;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x7684;&#x5305;&#x3002;&#x867D;&#x7136;&#x5B83;&#x53EF;&#x4EE5;&#x548C;&#x666E;&#x901A;&#x5305;&#x4E00;&#x6837;&#x7684;&#x5BFC;&#x5165;&#x548C;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x8BBF;&#x95EE;&#x8BED;&#x8A00;&#x5185;&#x90E8;&#x7279;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x76F8;&#x5173;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5C06;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x5C01;&#x88C5;&#x5230;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5305;&#x4E2D;&#xFF0C;&#x662F;&#x4E3A;&#x5728;&#x6781;&#x5C11;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x540C;&#x65F6;&#x5F15;&#x8D77;&#x4EBA;&#x4EEC;&#x7684;&#x6CE8;&#x610F;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x56E0;&#x4E3A;&#x770B;&#x5305;&#x7684;&#x540D;&#x5B57;&#x5C31;&#x77E5;&#x9053;&#x4F7F;&#x7528;unsafe&#x5305;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#xFF09;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x73AF;&#x5883;&#x56E0;&#x4E3A;&#x5B89;&#x5168;&#x7684;&#x56E0;&#x7D20;&#x53EF;&#x80FD;&#x9650;&#x5236;&#x8FD9;&#x4E2A;&#x5305;&#x7684;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;unsafe&#x5305;&#x88AB;&#x5E7F;&#x6CDB;&#x5730;&#x7528;&#x4E8E;&#x6BD4;&#x8F83;&#x4F4E;&#x7EA7;&#x7684;&#x5305;&#xFF0C;&#x4F8B;&#x5982;runtime&#x3001;os&#x3001;syscall&#x8FD8;&#x6709;net&#x5305;&#x7B49;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5BC6;&#x5207;&#x914D;&#x5408;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x666E;&#x901A;&#x7684;&#x7A0B;&#x5E8F;&#x4E00;&#x822C;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;unsafe&#x5305;&#x7684;&#x3002;</p>

                            </div>
                            
                        
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

<script src="../gitbook/gitbook.js"></script>

    
    <script src="../gitbook/gitbook-plugin-bg-nest/bg-nest.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-bg-nest/init.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
    

<script>
(function() {
    gitbook.page.hasChanged({"page":{"title":"底层编程","level":"1.14","depth":1,"next":{"title":"unsafe.Sizeof, Alignof 和 Offsetof","level":"1.14.1","depth":2,"path":"ch13/ch13-01.md","ref":"ch13/ch13-01.md","articles":[]},"previous":{"title":"几点忠告","level":"1.13.9","depth":2,"path":"ch12/ch12-09.md","ref":"ch12/ch12-09.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-opendocs","bg-nest","katex","-lunr","-search","search-pro","-sharing","-fontsettings","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-131598830-2"},"bg-nest":{},"katex":{},"search-pro":{},"highlight":{},"theme-opendocs":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"preface.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Go语言圣经","language":"zh-hans","gitbook":"3.x","description":"<The Go Programming Language>中文版"},"file":{"path":"ch13/ch13.md","mtime":"2019-08-14T08:20:28.117Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-08-14T08:21:33.379Z"},"basePath":"..","book":{"language":""}});
})();
</script>

        
    </body>
</html>

